Repository: SunWukong/cherrymusic
Catalog: res/i18n/*/default.po
Languages: fr

source: empty username or password!
fr: Nom d'utilisateur ou mot de passe non renseigné !

source: not a valid password
fr: Mot de passe invalide

source: name must not be empty
fr: le nom doit être renseigné

source: password must not be empty
fr: le mot de passe doit être renseigné

source: track has no path set!
fr: le chemin de la piste n'est pas renseigné !

source: track has no label set!
fr: la piste n'a pas d'étiquette !

source: Error listing directory %s: %s
fr: Erreur lors de la lecture du dossier %s: %s

source: %(user)s searched for '%(term)s'
fr: %(user)s ont recherché '%(term)s'

source: sorting DB results using ResultOrder
fr: Tri des données à l'aide de l'algorithme ResultOrder

source: checking and classifying results:
fr: vérification et tri du résultat :

source: Error fetching version info: %s
fr: Erreur lors de la récupération de l'information de version : %s

source: ========================================================================== Oops! CherryMusic changed some file locations while you weren't looking. (To better comply with best practices, if you wanna know.) To continue, please move the following: $ mv {src} {tgt}
fr: ========================================================================== Oops! CherryMusic a changé l'emplacement de certains fichiers pendant que vous regardiez ailleurs. (Afin de se conformer à l'état de l'art si vous voulez savoir pourquoi.) Pour continuer, merci de déplacer le fichier suivant : $ mv {src} {tgt}

source: %d years ago
fr: il y a %d ans

source: a year ago
fr: il y a un an

source: %d months ago
fr: il y a %d mois

source: a month ago
fr: il y a un mois

source: %d weeks ago
fr: il y a %d semaines

source: a week ago
fr: il y a une semaine

source: %d days ago
fr: il y a %d jours

source: a day ago
fr: il y a une journée

source: %d hours ago
fr: il y a %d heures

source: an hour ago
fr: il y a une heure

source: half an hour ago
fr: il y a une demi-heure

source: %d minutes ago
fr: il y a %d minutes

source: a minute ago
fr: il y a une minute

source: a few seconds ago
fr: il y a quelques secondes

source: in %d years
fr: dans %d ans

source: in a year
fr: dans un an

source: in %d months
fr: dans %d mois

source: in a month
fr: dans un mois

source: in %d weeks
fr: dans %d semaines

source: in a week
fr: dans une semaine

source: in %d days
fr: dans %d jours

source: in a day
fr: dans un jour

source: in %d hours
fr: dans %d heures

source: in an hour
fr: dans une heure

source: in half an hour
fr: dans une demi-heure

source: in %d minutes
fr: dans %d minutes

source: in a minute
fr: dans une minutes

source: in a few seconds
fr: dans quelques secondes

source: just now
fr: maintenant

source: Error writing file %(name)r to memory zip
fr: Erreur lors de l'écriture de l'archive %(name)r en mémoire

source: terms must not contain ''
fr: les paramètres ne doivent pas contenir le caractère ''

source: searching for a maximum of %s files
fr: À la recherche d'un maximum de %s fichiers

source: file id fetching
fr: récupération de l'ID du fichier

source: sorting results by fileid occurrences
fr: tri du résultat en fonction des occurrences des ID de fichiers

source: querying fullpaths for %s fileIds
fr: recherche des chemins absolus pour %s IDs de fichiers

source: querying fullpaths for %s fileIds, files only
fr: recherche des chemins absolus pour %s IDs de fichiers, uniquement les fichiers

source: media cache cannot listdir %r: path not in database
fr: le cache de média ne peut pas parcourir le dossier %r : ce chemin n'est pas connu de la base de données

source: wrong encoding for filename '%s' (%s)
fr: Encodage erroné du nom de fichier '%s' (%s)

source: removing dead reference(s): %s "%s"
fr: suppression de référence(s) obsolète(s) : %s "%s"

source: error while removing dead reference(s): %s
fr: erreur lors de la suppression de référence(s) obsolète(s) : %s

source: rolled back to safe state.
fr: Rollback dans un état sûr.

source: error removing entry for %s
fr: erreur lors de la suppression de l'élément %s

source: media base directory: %r
fr: dossier de base des médias : %r

source: running full update...
fr: mise à jour complète en cours…

source: error during media update. database update incomplete.
fr: erreur lors de l'analyse des médias. Mise à jour de la base de données incomplète.

source: media database update complete.
fr: Mise à jour de la base de données des médias terminée.

source: updating paths: %s
fr: mise à jour des chemins : %s

source: path is not in basedir. skipping %r
fr: chemin en dehors du dossier principal. %r ignoré

source: updating %r...
fr: mise à jour de %r…

source: update incomplete: %r
fr: mise à jour incomplète : %r

source: done updating paths.
fr: Fin de la mise à jour des dossiers.

source: recursive update for %s
fr: mise à jour récursive de %s

source: error while updating media: %s %s
fr: erreur lors de la mise à jour du média : %s %s

source: rollback to previous commit.
fr: Rollback jusqu'au commit précédent.

source: items added %d, removed %d
fr: %d éléments ajoutés, supprimés : %d

source: updating word occurrences...
fr: mise à jour des occurrences de mots…

source: argument must be an abolute path: "%s"
fr: l'argument doit être un chemin absolu : "%s"

source: argument must be a path in basedir (%s): "%s"
fr: l'argument doit être un sous-dossier du dossier principal (%s) : "%s"

source: parent path not in database: %r
fr: le chemin parent n'est pas dans la base de données : %r

source: shouldn't get here! (argument path not in basedir)
fr: on ne devrait pas traîner par ici ! (ce dossier n'est pas dans le dossier principal)

source: creating database entry for %r
fr: création d'une entrée dans la base de données pour %r

source: unable to decode filename %r in %r; skipping.
fr: incapable de décoder le nom de fichier %r dans %r, on zappe.

source: expecting unicode path, got %s
fr: chemin unicode attendu mais on a %s

source: non-root filepaths must be direct relative to parent: path: %s, parent: %s
fr: les dossiers non-racine doivent être rattaché directement au parent : dossier : %s, parent : %s

source: cannot list directory: %s
fr: incapable de parcourir le dossier : %s

source: file not found: %s. skipping.
fr: fichier introuvable : %s. on zappe.

source: file not in basedir: %s. skipping.
fr: fichier en dehors du dossier principal : %s. on zappe.

source: Loading files database into memory...
fr: Chargement de la base de données en mémoire…

source: cherrypy version is too old! Current version: %(current_version)s Required version: %(required_version)s or higher
fr: la version de cherrypy est obsolète ! Version installée : %(current_version)s Version requise : %(required_version)s ou plus récente

source: Could not determine cherrypy version. Please install cherrypy using pip or your OS's package manager. Trying to detect version automatically.
fr: Incapable de déterminer la version de cherrypy. Merci d'installer cherrypy à l'aide de pip ou du gestionnaire de paquets de votre système d'exploitation. Tentative de détection automatique de la version

source: database schema update aborted. quitting.
fr: Interruption de la mise à jour du schéma de la base de données. On quitte.

source: usernames may only contain letters and digits
fr: les noms ne peuvent contenir que des lettres et des chiffres

source: user with the name "%s" does not exist!
fr: l'utilisateur appelé "%s" n'existe pas !

source: Default configuration file written to %(path)r
fr: Création du fichier de configuration par défaut : %(path)r

source: Invalid basedir. Please provide a valid basedir path.
fr: Dossier principal invalide. Merci d'indiquer un dossier principal valide.

source: ============================================ Process id file %s already exists. If you are sure that cherrymusic is not running, you can delete this file and restart cherrymusic. ============================================
fr: ============================================ Le fichier d'identifiant de processus %s existe déjà. Si vous êtes sûr que cherrymusic n'est pas en cours d'exécution, vous pouvez supprimer ce fichieret redémarrer cherrymusic. ============================================

source: Error removing pid file, doesn't exist!
fr: Erreur lors de la suppression du fichier d'identifiant de processus : il n'existe pas !

source: Starting server on port %s ...
fr: Démarrage du serveur sur le port %s…

source: ========================================================================== A database schema update is needed and requires your consent. {reasons} To continue without changes, you need to downgrade to an earlier version of CherryMusic. To backup your database files first, abort for now and find them here: {dblocation} ========================================================================== Run schema update? [y/N]:
fr: ========================================================================== Une mise à jour du schéma de la base de données s'impose et nécessite votre accord. {reasons} Pour continuer sans changement, vous devez revenir à une version antérieure de CherryMusic. Pour procéder à une sauvegarde préalable de vos fichiers de base de données, interrompez le script et sauvegardez vos fichiers localisés ici : {dblocation} ========================================================================== Procéder à la mise à jour du schéma de la base de données ? [y/N]:

source: New configuration options available: %s Using default values for now.
fr: De nouvelles options de configuration sont disponibles : %s Utilisation des valeurs par défaut pour l'instant.

source: The following configuration options are not used anymore: %s
fr: Les options de configurations suivantes ne sont plus utilisées : %s

source: Start with --newconfig to generate a new default config file next to your current one.
fr: Démarrer avec l'option --newconfig pour générer un nouveau fichier de configuration par défaut à côté de votre fichier actuel.

source: Exception while updating database schema.
fr: Exception levée lors de la mise à jour du schéma de base de données.

source: Database error. This is probably due to your version of sqlite being too old. Try updating sqlite3 and updating python. If the problem persists, you will need to delete the database at
fr: Erreur de base de données. Ceci est probablement imputable à votre version obsolète de sqlite. Essayez de mettre à jour sqlite3 ainsi que votre interpréteur python. Si le problème persiste, vous devrez effacer le fichier de base de données situé ici :

source: This playlist doesn't exist! Nothing deleted!
fr: Cette liste de lecture n'existe pas ! Rien à supprimer !

source: This playlist belongs to another user! Nothing deleted.
fr: Cette liste de lecture appartient à un autre utilisateur ! Rien à supprimer !

source: I will not create an empty playlist. sorry.
fr: Désolé mais je ne crée pas des listes de lecture vides.

source: This playlist name already exists! Nothing saved.
fr: Une liste de lecture portant ce nom existe déjà ! Rien n'a été sauvegardé.

source: Not secure, redirecting...
fr: Connexion non sécurisée, redirection en cours…

source: user {name} just logged in.
fr: l'utilisateur {name} vient de s'authentifier.

source: Dropping all sessions! Try not to change between python 2 and 3, everybody has to relogin now.
fr: Fermeture de toutes les sessions! Contournement bug #1216 dans cherrypy, Tout le monde doit de reconnecter.

source: Rejected remote admin login from user: {name}
fr: Rejet de la tentative de connexion admin de l'utilisateur : {name}

source: Fetching album art for keywords {keywords!r}
fr: Recherche de jaquettes à partir des mot clés {keywords!r}

source: processing whole search request
fr: traitement de la reque de recherche globale

source: rendering search results as json
fr: rendu json des résultats de la recherche

source: Please log in
fr: Merci de vous authentifier

source: Unknown playlist format: {format!r}
fr: Format de liste de lecture inconnu : {format!r}

source: No playlists found
fr: Aucune liste de lecture n'a été trouvée

source: BASEDIR specifies where the media that should be served is located. It must be an absolute path, e.g. BASEDIR=/absolute/path/to/media. Links: If your operating system supports them, you can use symlinks directly in BASEDIR. Links to directories which contain BASEDIR will be ignored, just like all links not directly in, but in sublevels of BASEDIR. This is to guard against the adverse effects of link cycles.
fr: BASEDIR (dossier principal) indique où est situé le dossier contenant les media devant être servis. Ce doit être un chemin absolu, e.g. BASEDIR=/chemin/complet/vers/les/media. Liens : Si votre système d'exploitation est évolué, vous pouvez définir dans le dossier BASEDIR des liens symboliques vers vos médias. Les liens vers des sous-dossiers de BASEDIR ne seront pas pris en compte, à quelque niveau de hiérarchie que ce soit afin d'éviter des effets de liens infinis.

source: TRANSCODE (experimental!) enables automatic live transcoding of the media to be able to listen to every format on every device. This requires you to have the appropriate codecs installed. Please note that transcoding will significantly increase the stress on the CPU!
fr: TRANSCODE (experimental!) permet le transcodage automatique à la volée des media afin de pouvoir écouter n'importe quel format audio sur n'importe quel appareil. Cela nécessite que les codecs appropriés soient installés au préalable. Veuillez noter que le transcodage à la volée augmente la consommation de ressources CPU!

source: Tries to fetch the album cover from various locations in the web, if no image is found locally. By default it will be fetched from iTunes. They will be shown next to folders that qualify as a possible album.
fr: Tente de télécharger les jaquettes des album à partir de différentes ressources du web, si aucune image n'est trouvée en local. Par défaut, on essaiera depuis iTunes. Les jaquettes seront affichées à côtés des dossiers supposés contenir un album.

source: Show the number of sub-folders and tracks contained in any folder. This will increase the stress for the server, so if you're running CherryMusic on a 386DX II or similar, it is recommended to deactivate this feature.
fr: Affiche le nombre de sous-dossiers et de pistes de chaque dossier. Cela entraîne une plus grande consommation de ressources CPU sur le serveur, aussi, si vous faîtes tourner CherryMusic sur un 386DX II ou assimilé, il est fortement recommandé de désactiver cette option.

source: megabytes
fr: mégaoctets

source: Maximum size in bytes of all files to be downloaded in one zipfile. Defaults to {default_value} {default_unit}.
fr: Taille maximale en octets de tous les fichiers pouvant être téléchargés en une unique archive zip. Par défaut : {default_value} {default_unit}.

source: MAXRESULTS sets the maximum amount of search results to be displayed. If MAXRESULTS is set to a higher value, the search will take longer, but will also be more accurate.
fr: MAXRESULTS indique le nombre maximal de résultats de recherche à afficher. Plus MAXRESULTS est grand, plus la recherche sera longue, mais plus le résultat sera précis.

source: This will load parts of the database into memory for improved performance. This option should only be used on systems with sufficient memory, because it will hurt the performance otherwise.
fr: Permet de charger en mémoire une partie de la base de données afin d'améliorer les performances. Ne devrait être utilisé que sur des serveurs suffisamment équipés de mémoire sous peine de dégrader les performances.

source: MAXSHOWFILES specifies how many files and folders should be shown at the same time. E.g. if you open a folder with more than MAXSHOWFILES, the files will be grouped according to the first letter in their name. 100 is a good value, as a CD can have up to 99 tracks.
fr: MAXSHOWFILES indique combien de fichiers et dossiers doivent être affichés en même temps E.g. si vous ouvrez un dossier contenant plus de MAXSHOWFILES éléments, les fichiers seront groupés selon la première lettre de leur nom. 100 est une bonne valeur, puisqu'un CD ne peut contenir plus de 99 pistes.

source: Only use the media database, never the filesystem, for content lookups in browser and search. Useful if the media files reside on an external hard drive or behind a slow network connection.
fr: Utiliser uniquement la base de données, et jamais le système de fichiers, pour parcourir les pistes et pour les recherches. Utile si les fichiers de média sont stockés sur un périphérique lent (disque dur externe, connexion réseau lente, …).

source: The port the server will listen to.
fr: Numéro de port sur lequel le serveur doit se mettre à l'écoute.

source: When set to true, the server will listen on a IPv6 socket instead of IPv4
fr: Paramétré à True, le serveur écoutera une socket IPv6 au lieu de IPv4

source: When localhost_only is set to true, the server will not be visible in the network and only play music on the same computer it is running on. Activating this option binds the server to IP 127.0.0.1 or [::1], depending on whether server.ipv6_enabled is true. The server should also be reachable as "localhost" in any case.
fr: Paramétré à True, le serveur ne sera pas visible sur le réseau local et l'on ne pourra écouter la musique que sur le serveur lui-même. Activer cette option attache le serveur sur l'adresse IP 127.0.0.1 ou [::1], selon que l'option server.ipv6_enabled est activée ou non. Le serveur devrait être accessible en tant que "localhost" dans tous les cas.

source: The path cherrymusic will be available on. Normally you'll want to leave it as '/', so that CherryMusic is available under e.g. localhost:8080. You might want to change the path if CherryMusic runs behind a reverse proxy. Changing it to '/cherrymusic' will make it available under e.g. localhost:8080/cherrymusic
fr: Chemin où cherrymusic sera accessible. Normalement, vous souhaiterez laisser '/', afin que CherryMusic soit accessible à l'URL suivante : localhost:8080 Vous pourriez avoir besoin de changer cette valeur si CherryMusic tourne derrière un proxy inverse. Changer cette valeur pour '/cherrymusic' rendra CherryMusic accessible à l'URL suivante : localhost:8080/cherrymusic

source: When localhost_auto_login is set to "True", the server will not ask for credentials when using it locally. The user will be automatically logged in as admin.
fr: Quand localhost_auto_login est paramétré à "True", le serveur ne nécessite pas d'authentification quand il est utilisé en local. L'utilisateur est alors automatiquement connecté en tant qu'administrateur.

source: When permit_remote_admin_login is set to "False", admin users may only log in from the computer cherrymusic is currently running on. This can improve security.
fr: Quand permit_remote_admin_login est paramétré à "False", les utilisateurs administrateurs ne peuvent se connecter que depuis le serveur où tourne ChrryMusic. Cela permet d'augmenter la sécurité de l'installation.

source: Will keep the user sessions in RAM instead of a file in the configuration directory. This means, that any unsaved playlists will be lost when the server is restarted.
fr: Paramétré à "True", permet au serveur de conserver les sessions utilisateurs en mémoire RAM au lieu d'un fichier dans le dosser de configuration Cela entraîne que toute liste de lecture non sauvegardée sera perdue au redémarrage du serveur.

source: The following options allow you to use cherrymusic with https encryption. If ssl_enabled is set to "False", all other ssl options will be ommited.
fr: Les options suivantes permettent de mettre en œuvre le cryptage https. Si ssl_enabled est configuré à "False", toute les options SSL sont ignorées.

source: The port that will listen to SSL encrypted requests. If ssl_enabled is set to "True", all unencrypted HTTP requests will be redirected to this port.
fr: Numéro de port sur lequel CherryMusic doit se mettre en écoute des requêtes HTTPS sécurisées par SSL. Si ssl_enabled est paramétré à "True", toutes les requêtes non sécurisées seront redirigées vers ce port.

source: The SSL certiticate sent to the client to verify the server's authenticity. A relative path is relative to the location of the CherryMusic configuration file.
fr: Chemin vers le certificat SSL qui sera envoyé au client afin de lui permettre de vérifier l'authenticité du serveur. Un chemin relatif est relatif par rapport au fichier de configuration de CherryMusic.

source: SSL private key file used by the server to decrypt and sign secure communications. Keep this one secret! A relative path is relative to the location of the CherryMusic configuration file.
fr: Fichier contenant la clé privée SSL pour déchiffrer et signer les communications sécurisées. Attention : garder ce fichier secret ! Un chemin relatif est relatif par rapport au fichier de configuration de CherryMusic.

source: Notify admins about available security and feature updates.
fr: Informe les administrateurs de la disponibilité de mises à jour de sécurité ou fonctionnelles.

source: configuration file not found: %(filepath)s
fr: fichier de configuration non trouvé : %(filepath)s

source: configuration path is not a file: %(filepath)s
fr: le dossier de configuration n'est pas un fichier : %(filepath)s

source: resizing of album covers
fr: redimensionnement des jaquettes d'album

source: The executable "convert" was not found in you PATH
fr: Le programme "convert" n'a pas pu été trouvé à partir de votre PATH

source: encoding and decoding of OGGs
fr: codage et décodage des fichiers OGG

source: The executables "oggenc" and "oggdec" were not found in you PATH
fr: Les programmes "oggenc" et "oggdec" n'ont pas pu été trouvés à partir de votre PATH

source: encoding and decoding of MP3s
fr: encodage et décodage de fichiers MP3

source: The executable "lame" was not found in you PATH
fr: Le programme "lame" n'a pas pu été trouvé à partir de votre PATH

source: encoding and decoding of FLACs
fr: encodage et décodage de fichiers FLAC

source: The executable "flac" was not found in you PATH
fr: Le programme "flac" n'a pas pu été trouvé à partir de votre PATH

source: decoding OGG, MP3, FLAC, WMA and AAC
fr: décodage de fichiers OGG, MP3, FLAC, WMA et AAC

source: The executable "mplayer" was not found in you PATH
fr: Le programme "mplayer" n'a pas pu été trouvé à partir de votre PATH

source: Starting setup server on port {port} ... Open your browser and put the server IP:{port} in the address bar. If you run the server locally, use: localhost:{port}.
fr: Démarrage du serveur sur le port {port} ... Ouvrez votre navigateur et indiquez l'adresse IP du serveur suivie de :{port} dans la barre d'adresse. Si vous utilisez un serveur installé en local, utilisez l'adresse : localhost:{port}.
